---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericImportWarning
source: html/3d7dc58d-83c0-f515-7575-b7bdf85e5b55.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.IFCGenericImportWarning Property

The following problems were encountered in the IFC file: [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId IFCGenericImportWarning { get; }
```